'''
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
Вместе они сделали S журавликов. Сколько журавликов сделал 
каждый ребенок, если известно, что Петя и Сережа сделали 
одинаковое количество журавликов, а Катя сделала в два раза 
больше журавликов, чем Петя и Сережа вместе?
*Пример:*
6 -> 1  4  1
24 -> 4  16  4
60 -> 10  40  10
'''

fullAmount = int(input('Введите общее количество сделанных журавликов: '))
count1 = fullAmount//6
count2 = 4*count1
print(f'Катя сделала {count2} журавликов, Петя и Сережа сделали по {count1} журавликов.')